bank_clients = [
    ('Бикедина Вероника Сергеевна', 15000.0, 12.0, 24, 1, 0.0),
    ('Дегтярева Софья Игоревна', 10000.0, 10.5, 12, 0, 0.0),
    ('Конощенко Максим Олегович', 13000.0, 14.0, 36, 1, 0.0),
    ('Анохин Ярослав Дмитриевич', 12500.0, 16.0, 18, 0, 0.0),
    ('Шевлюга Алексей Иванович', 20000.0, 11.0, 12, 1, 0.0),
    ('Даглдиян Ованес Амбарцумович', 8000.0, 13.5, 6, 0, 0.0),
    ('Черненко Анна Владимировна', 11500.0, 15.0, 24, 1, 0.0),
    ('Костина Александра Николаевна', 17000.0, 12.5, 48, 1, 0.0),
    ('Горячева Татьяна Сергеевна', 9500.0, 10.0, 18, 0, 0.0),
    ('Попов Владислав Александрович', 14000.0, 14.5, 12, 1, 0.0)
]